CSI API ETABS v1

# cSapModelSelectObj Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cSelect SelectObj { get; }

    ReadOnly Property SelectObj As cSelect
    	Get

    Dim instance As cSapModel
    Dim value As cSelect

    value = instance.SelectObj

    property cSelect^ SelectObj {
    	cSelect^ get ();
    }

    abstract SelectObj : cSelect with get

#### Property Value

Type: cSelect

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com